#+title: Projects

* PROJ Misc
** TODO Schedule haircut :Computer:
** TODO Find good time in schedule for regular climbing/workout :Computer:
** TODO Find/order power cable for record player :Computer:
** TODO Look for water filter replacements (probably in basement somewhere) :Home:
** TODO Check for Aires MR review "requests" :Work:
   DEADLINE: <2026-06-29 Mon +1w>
   :PROPERTIES:
   :LAST_REPEAT: [2026-06-22 Mon 15:50]
   :END:
- State "DONE"       from "TODO"       [2026-06-22 Mon 15:50]
- State "DONE"       from "TODO"       [2026-06-17 Wed 14:14]
** TODO Cancel Fox One
   DEADLINE: <2026-07-15 Wed>
** TODO Listen to new Strokes album
   DEADLINE: <2026-07-24 Fri>
** TODO Liquidate money for Anne's credit card :Computer:
10k
** TODO Find lampshade :Home:Computer:
** TODO Talk to Andrew about unitary perturbation stuff :Work:
DEADLINE: <2026-06-29 Mon>
* PROJ Rigetti :Computer:
- Read papers by Eyob and [[https://scholar.google.com/citations?user=oonQr0UAAAAJ&hl=en][Stefano Poletto]]
- Talk - they'll want to see how you communicate with experimentalists/everyone
- Whiteboard questions - kinda like qual exam
** WAIT Next interview steps
   DEADLINE: <2026-06-29 Mon>
** TODO Find Rigetti papers to read
* PROJ Set up habit tracker :Computer:
- Brushing Asher's teeth
- Flea tick heartworm
- Walking/running
- Meds
- Meditation
- Getting into work at a decent time?
- Waking up at a good time
- Watering plants
- CSA pickup
- CSA selection
- Cleaning
- Org journal
- Keep in touch with important people
  - Mom & Pops
  - Droob
  - Sambert
- GTD weekly review
  - Touch base with Anne about her schedule for the week
- Go through mail
** TODO Look at Organice's habit tracker tutorial again
*** TODO Then figure out how to use it in regular org mode
* PROJ Camping Trip :Computer:
SCHEDULED: <2026-08-28 Fri>--<2026-08-30 Sun>
LOCATION: Shackleford Banks
[[https://docs.google.com/document/d/1M5FSvqyBXA9tbLYpV6EOMGq9g9krAj3tq0WsO3zutRI/edit?tab=t.0][Google Doc]]

** WAIT Get Grant & Ford's availability
** DONE Decide on date and location


* PROJ Iceland prep :Computer:
  SCHEDULED: <2026-07-08 Wed--<2026-07-17 Fri>>
** TODO Book rental car for Iceland :Computer:
   DEADLINE: <2026-06-23 Tue>
** TODO Figure out what I need to buy still
- [ ] Rain pants
- [ ] Long johns
- [ ] Bathing suit
- [ ] Hiking boots
** DONE Board boochie for Iceland :Computer:
* PROJ Org Mode / GTD improvements :Computer:
** TODO [[https://www.labri.fr/perso/nrougier/GTD/index.html][Rougier's Org Mode GTD]]
   :LOGBOOK:
   CLOCK: [2026-06-22 Mon 16:26]--[2026-06-22 Mon 16:51] =>  0:25
   :END:
** DONE [#A] [[https://blog.jethro.dev/posts/org_mode_workflow_preview/][Jethro's Org Mode workflow]]
   :LOGBOOK:
   CLOCK: [2026-06-24 Wed 16:39]--[2026-06-24 Wed 16:40] =>  0:01
   CLOCK: [2026-06-24 Wed 16:38]--[2026-06-24 Wed 16:39] =>  0:01
   :END:
Author of Org Roam
** PROJ [[https://www.orgroam.com/manual.html][Org Roam]]
*** TODO Read through manual
*** TODO Copy over notes from Notes.org
*** TODO Take some notes from [[*\[\[https://www.youtube.com/playlist?list=PLhXZp00uXBk4np17N39WvB80zgxlZfVwj\]\[Zaiste Doomcasts\]\]][Zaiste Doomcasts]]
*** TODO Watch [[https://www.youtube.com/watch?v=DbsAQSIKQXk][No Boilerplate's Obsidian videos]] for inspo
** TODO Finish [[https://organice.200ok.ch/sample][Organice tutorial]] :Phone:
** PROJ Org Capture
*** TODO Set up capture templates
**** DONE Inbox
**** TODO Quick note (into Org Roam)
**** TODO Link w/ [[*\[\[https://blog.jethro.dev/posts/org_mode_workflow_preview/\]\[Jethro's Org Mode workflow\]\]][org-protocol]]
*** TODO Make sure that's working on Organice
** PROJ Org Agenda
*** DONE Find another tutorial about it
*** TODO How to format times as 12hr times
** PROJ Org Journal
*** TODO Set up journal directory to be synced
** PROJ Org crypt
*** TODO Figure out how to use

1. Add the flag:
   #+begin_src elisp
;; init.el
(org +crypt)
   #+end_src

2. Configure Encryption Method
By default, Org Crypt looks for a specific GPG public key. If you prefer a simple password (symmetric encryption), you must specify this in your  file. [1, 8, 9]
Open config and add: [10, 11]
#+begin_src elisp
;; config.el
(after! org-crypt
  (setq org-crypt-key nil))
#+end_src
(Note: If you want to use a specific GPG key instead, change  to your key's email address or ID string). [8, 12]
3. Encrypting Your Notes
Org Crypt works inline using tags.

 1. Create a heading in an org file and assign it the :crypt: tag:
 2. Save the file.
 3. Doom Emacs will automatically intercept the save, prompt you for a passphrase in the minibuffer, and mask the text. It will look like this: [1, 13, 14, 15, 16]

4. Decrypting and Keybindings
The text will remain encrypted on your hard drive. To read or edit it, place your cursor on the headline and manually call the decrypt command:
- M-x org-decrypt-entry
- M-x org-encrypt-entry

  Nice keybindings:
  #+begin_src elisp
(map! :map org-mode-map
      :localleader
      :desc "Decrypt entry" "d" #'org-decrypt-entry
      :desc "Encrypt entry" "e" #'org-encrypt-entry)
  #+end_src

** TODO Turn off word suggestions in org/text modes
** TODO Install LaTeX and other packages necessary for LaTeX preview in org mode :Home:
** TODO Check out [[https://apps.apple.com/us/app/beorg-to-do-list-agenda/id1238649962][beorg]] :Phone:
** TODO Look into org-appear
Allows you to hide emphasis markers until you move the cursor over them
/Entered on/ [2026-06-24 Wed 16:09]
** TODO Look into mu4e and capturing emails
/Entered on/ [2026-06-24 Wed 16:16]
* PROJ Doctor appts :Computer:
** TODO Schedule doctor's appt :Computer:
** TODO Schedule eye exam :Computer:
* PROJ Kitchen setup :Home:
** TODO Bring up last of kitchen stuff from basement
** PROJ Reason cast iron pan
*** TODO Look up how to reseason (might still have card)
** PROJ Hang knife bar
*** TODO Figure out where to hang bar
* PROJ Organize tools :Home:
** TODO Move tools into tool cabinet
* PROJ Basement pile :Home:
** TODO Go through basement pile by laundry
* PROJ Bird's nest in light fixture :Yard:
** TODO Clear out nest in light fixture
* PROJ Gardening :Yard:
** TODO When/where to move hostas :Anne:
DEADLINE: <2026-07-04 Sat>
** TODO Decide where to put tree :Anne:
DEADLINE: <2026-07-04 Sat>
** TODO When/where to plant Jersey Tea bush :Anne:
DEADLINE: <2026-07-04 Sat>
* PROJ Spray for ticks :Yard:
** TODO Spray for ticks while Anne is gone
* PROJ Spray Pachysandra :Yard:
** TODO Spray while Anne is gone
* PROJ Crafting Interpreters :Computer:
** TODO Recall state of cLox
* PROJ Fix PC freezing issue :Home:
** TODO Defrag PC
** TODO Look up why PC might be freezing
* PROJ Fix sink
** TODO Look up how to fix sink
* PROJ Hang plant shelf & coffee bag
** TODO Pick date to do it when Asher is at camp
* PROJ complete_subspace :Work:
Add an eigenstate whenever there's an avoided crossing out of the subspace
Or just "track" initial subspace
** DONE Make new branch for complete_subspace
** DONE Assign complete_subspace ticket to myself
** TODO Write function to detect first small singular value
Search each rank individually, then take min index
** TODO Write function to calculate another eigenvector if needed
* PROJ MPO Sum MR :Work:
** WAIT Reviewers
** DONE Address Jason's comments on bond dimension display
** DONE Move mpo_terms to CircuitDMRG's params
   :LOGBOOK:
   CLOCK: [2026-06-26 Fri 12:11]--[2026-06-26 Fri 12:39] =>  0:28
   CLOCK: [2026-06-26 Fri 11:54]--[2026-06-26 Fri 12:05] =>  0:11
   :END:
** DONE Fix bra_op_ket_symbolic
   :LOGBOOK:
   CLOCK: [2026-06-26 Fri 12:39]--[2026-06-26 Fri 12:45] =>  0:06
   :END:
* PROJ Profiling MPO Sums :Work:
** WAIT Check on Tyler's progress
   SCHEDULED: <2026-06-25 Thu 13:00>
* PROJ Groceries :Shopping:
** DONE Berries
** DONE PB
** DONE Brocolli
** DONE Sweet potatoes
** DONE Arugala
** DONE Hummus
** DONE Tofu
** DONE Honey
** DONE Chickpeas
** DONE Canned tomatoes
** DONE My yogurt
** DONE Coconut milk
** DONE Leeks
** DONE Shrooms
** DONE Pasta
** DONE Frozen berries
** DONE Chocolate chips
** DONE Dog food
** DONE Paper towels
* PROJ Target :Shopping:
** DONE Loop earplugs (aisle H31)
* PROJ Howl :Shopping:
* PROJ Home Depot :Shopping:
** TODO Level
* PROJ Date nights/ideas
** TODO Find time in schedule for a date night/adventure card :Computer:
* PROJ Create Doom config repo / dotfiles repo
** TODO Make gitlab repo and upload my .doom.d
** TODO Look into GNU Stow / Nix home manager
** TODO Literate Doom config
You're about at the tipping point where it's going to keep getting more and more involved

/Entered on/ [2026-06-24 Wed 16:51]
** TODO Fix org mode config
I think some things need to be set after org loads, but I can't figure out what
/Entered on/ [2026-06-27 Sat 19:19]
* PROJ extend_subspace :Work:
Combine subspaces at adjacent timepoints
Can use derived error metric to determine how good the subspace approximation is & adaptively extend
Might need to look into better method for orthonormalizing MPSes
** TODO Make new branch for extend_subspace
** TODO Implement comonadic duplicate method
